<details><summary>Digger run report at 2023-10-10 18:07:16 (UTC)</summary>
                <details><summary>Plan for <b>rimvydascivilis/app-infra#live_staging_data</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.1

Terraform has been successfully initialized!
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>

<details><summary>Terraform plan validation check (live_staging_data)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/app-infra#live_staging_eks</b></summary>
  
```terraform
module.kms.data.aws_partition.current: Reading...
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Reading...
module.kms.data.aws_caller_identity.current: Reading...
module.eks_managed_node_group["general"].data.aws_partition.current: Reading...
aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-staging/cluster]
aws_security_group.node[0]: Refreshing state... [id=sg-06030b690dc3cf699]
aws_security_group.cluster[0]: Refreshing state... [id=sg-00fcfc735f82157a5]
module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_managed_node_group["general"].data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_partition.current: Reading...
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_managed_node_group["general"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_managed_node_group["general"].aws_iam_role.this[0]: Refreshing state... [id=general-eks-node-group-20231010122252969900000002]
data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
aws_iam_role.this[0]: Refreshing state... [id=eks-staging-cluster-20231010122252968700000001]
module.eks_managed_node_group["general"].data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
data.aws_iam_session_context.current: Reading...
data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::039454511521:user/rimvydas]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=039454511521]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=general-eks-node-group-20231010122252969900000002-20231010122253779600000006]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=general-eks-node-group-20231010122252969900000002-20231010122253703900000005]
module.eks_managed_node_group["general"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=general-eks-node-group-20231010122252969900000002-20231010122253825000000007]
aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-4144928800]
aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4279920852]
aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3610322247]
aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2622740763]
aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-585937255]
aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-83275930]
aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2695435125]
aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1427226253]
aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1179484844]
aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3091680380]
aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-647261123]
aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-staging-cluster-20231010122252968700000001-20231010122254001300000009]
aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-staging-cluster-20231010122252968700000001-20231010122253998600000008]
module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3318154131]
module.kms.aws_kms_key.this[0]: Refreshing state... [id=4ae4b33a-e625-4432-bd8f-40d15d026488]
aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-ClusterEncryption2023101012231641330000000a]
module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-staging]
aws_eks_cluster.this[0]: Refreshing state... [id=eks-staging]
aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-staging-cluster-20231010122252968700000001-2023101012231685260000000b]
time_sleep.this[0]: Refreshing state... [id=2023-10-10T12:31:41Z]
data.tls_certificate.this[0]: Reading...
data.aws_eks_addon_version.this["vpc-cni"]: Reading...
data.aws_eks_addon_version.this["coredns"]: Reading...
data.aws_eks_addon_version.this["kube-proxy"]: Reading...
aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-00a98a4bbb01879a7,Environment]
aws_ec2_tag.cluster_primary_security_group["Terraform"]: Refreshing state... [id=sg-00a98a4bbb01879a7,Terraform]
module.eks_managed_node_group["general"].aws_launch_template.this[0]: Refreshing state... [id=lt-0605c3223d27b442d]
data.tls_certificate.this[0]: Read complete after 0s [id=5933588ce34e24e9fb40c3565fb0b5993639df67]
aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D]
module.eks_managed_node_group["general"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-staging:general-2023101012314309990000000e]
data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-staging:coredns]
aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-staging:kube-proxy]
aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-staging:vpc-cni]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_managed_node_group["general"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "eks-staging:general-2023101012314309990000000e"
      + labels                 = {}
        tags                   = {
            "Environment" = "staging"
            "Name"        = "general"
            "Terraform"   = "true"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (live_staging_eks)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/app-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_policy.aws_load_balancer_controller[0] will be created
  + resource "aws_iam_policy" "aws_load_balancer_controller" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "eks-staging-load-balancer-controller"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.aws_load_balancer_controller[0] will be created
  + resource "aws_iam_role" "aws_load_balancer_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-staging-load-balancer-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.aws_load_balancer_controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "aws_load_balancer_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-staging-load-balancer-controller"
    }

  # helm_release.aws_load_balancer_controller[0] will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.6.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "eks-staging"
        }
      + set {
          + name  = "image.tag"
          + value = "v2.6.1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_k8s-addons)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>rimvydascivilis/app-infra#live_staging_vpc</b></summary>
  
```terraform
Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.20.1

Terraform has been successfully initialized!
aws_vpc.this[0]: Refreshing state... [id=vpc-02a03faff519fa382]
aws_route_table.public[0]: Refreshing state... [id=rtb-08462bc1a1f939651]
aws_subnet.public[2]: Refreshing state... [id=subnet-03cd59b9f0f679048]
aws_subnet.public[0]: Refreshing state... [id=subnet-01f526ebb2415f9c9]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-08d118187c1c54973]
aws_subnet.public[1]: Refreshing state... [id=subnet-0b65faec2d074212a]
aws_default_security_group.this[0]: Refreshing state... [id=sg-0dd57cc2c0d5c564e]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-02dec8ba8180cdaaf]
aws_route_table.private[0]: Refreshing state... [id=rtb-09e0d9b0846d7982f]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ef05d06658abf6c1]
aws_subnet.intra[0]: Refreshing state... [id=subnet-0ef987da39abc9d14]
aws_subnet.intra[1]: Refreshing state... [id=subnet-028272c89d907907e]
aws_subnet.intra[2]: Refreshing state... [id=subnet-09b2d330a203e78fb]
aws_subnet.private[1]: Refreshing state... [id=subnet-0cbac79f5cdac698d]
aws_route_table.intra[0]: Refreshing state... [id=rtb-06f35047538be894d]
aws_subnet.private[0]: Refreshing state... [id=subnet-0f3b3a0b79843026c]
aws_subnet.private[2]: Refreshing state... [id=subnet-075985110aa9a2d0f]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0413a31dd5cbf860c]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08462bc1a1f9396511080289494]
aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0d72555520dfd6903]
aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-070e5944dc244b1c1]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dc6be7913239b648]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e7cac23638434d01]
aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0561cf1cd7aaa85f4]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-003ec8d6124888206]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d37ae4fecc63d975]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0793317483e167273]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-085192e6b0e585192]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-0ecf69b9d558b5773]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09e0d9b0846d7982f1080289494]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
</details>


<details><summary>Terraform plan validation check (live_staging_vpc)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>